[
    {
      "designation": "ERP and Technical Lead | Project Management| 10+ years of hands-on experience in Software Development Life Cycle",
      "organization": "Orion Group",
      "date": "December 2023 — Present",
      "jobs": [
        "- AI Projects: Developed and deployed solutions for FAQ Chatbot, Disease Prediction, Employee Image Tracking using Machine Learning and AI-driven models.",
        "- Enterprise Software Solutions: Orion Tea ERP and PrismERP to streamline organizational workflows.",
        "- Software Customization Projects: KPI Based Assessment System, National Sales System (Pharma) , HRMIS, E-Document Tracking System.",
        "- Leadership & Technology Stack: Managed a cross-functional development team, designing, coding, testing, and deploying solutions across web platforms using ASP.NET MVC, WPF, SQL Server, Java."
      ]
    },
    {
      "designation": "CTM SAP - SD Module (OHAL & POWER)",
      "organization": "Orion Group",
      "date": "December 2021 - December 2023",
      "jobs": [
        "- SAP Landscape Management – Ensured robust and consistent operations across SAP modules, overseeing system updates, configurations, and integration points for efficient enterprise performance.",
        "- Module Expertise: Designed and implemented solutions within SD submodules, ensuring smooth integration with other SAP modules and supporting end-to-end sales and distribution operations.",
        "- Master Data Management: Prepared and maintained Material, Vendor, and Service Master Data to ensure accuracy and consistency.",
        "- Procurement Lifecycle: Managed vendor selection and enrolment, purchase requisitions, quotations, comparative statements, and purchasing processes (local, asset, subcontracting).",
        "- Logistics & Quality: Supervised material receipts, incoming quality control, and ensured compliance with organizational standards.",
        "- Finance & Settlement: Coordinated the settlement of vendor bills, stock accounting, and valuation to align with financial reporting requirements.",
        "- Customization & Reporting: Designed and delivered custom SAP forms and reports to meet business and regulatory needs."
      ]
    },    
    {
      "designation": "Senior Software Engineer",
      "organization": "Orion Group",
      "date": "January 2015 - December 2017",
      "jobs": [
        "- Enterprise Software Solutions: Orion Tea ERP, Human Resource Management Information System (HRMIS), Material Management System (MM), Accounting System.",
        "- Software Customization Projects: Employee Appraisal System, E-Document Tracking System.",
        "- Leadership & Technology Stack: Managed a team in the development and deployment of multi-platform applications, ensuring functionality, performance, and scalability using ASP.NET, WPF, SQL Server, PostgreSQL"
      ]
    },
    {
      "designation": "Software Engineer",
      "organization": "Orion Group",
      "date": "Jul 2014 - December 2017",
      "jobs": [
        "- Enterprise Solutions: Accounting System, Inventory Management System , Employee Appraisal System (Monthly & Yearly), E-Document Tracking System.",
        "- ERP Implementation: Led ERP rollout for Orion Home Appliances, including system configuration and integration.",
        "- Business Applications: National Sales System (Pharma)  & KPI Base Assessment System.",     
        "- Business Analysis: Collected requirements, translated them into technical specifications, and oversaw full software development lifecycle.",
        "- Research & Innovation: Investigated modern development frameworks and platform-agnostic technologies to optimize scalability and system adaptability.",
        "- Technology Stack: Developed projects using ASP.NET, WPF, MVC, SQL Server, Java."
      ]
    },
    {
      "designation": "Software Engineer",
      "organization": "Lexinear System Ltd.",
      "date": "Jul 2013 - Jun 2014",
      "jobs": [
        "- Software Development and Maintenance",
        "- Investigating and using new technologies",
        "- Project: Accounting System, Inventory Management System, ERP",
        "- Technology Stack: Designed and developed applications using ASP.NET and SQL Server.",
        "- Business Analysis: Gathered requirements, prepared functional specifications, translated business needs into technical solutions and co-ordination.",
        "- Innovation & R&D: Researched and evaluated emerging technologies to improve system performance and cross-platform adaptability."
      ]
    },
    {
      "designation": "Programmer",
      "organization": "SoftLink Limited",
      "date": "March 2012 - December 2013",
      "jobs": [
        "- Software Development and Maintenance (accounting system, Multi-Level Marketing, Point of Sales)",
        "- Business requirement analysis and co-ordination for Software development and support.", 
        "- Technology : ASP.NET and SQL Server Management.",
        "- Investigating and using new technologies",
        "- Project : Accounting system, Multi-Level Marketing, Point of Sales"
      ]
    }
  ]